#  -------------------------------------------------------------------------------------------------
#  TASK 097 (Строковое представление)
#  -------------------------------------------------------------------------------------------------
#  Напишите программу, которая будет превращать натуральное число в строку, заменяя все цифры в числе на слова:
#  0 на zero; 1 на one; 2 на two; 3 на three; 4 на four; 5 на five; 6 на six; 7 на seven; 8 на eight; 9 на nine.
#  -------------------------------------------------------------------------------------------------

# nums = {0: "zero", 1: "one", 2: "two", 3: "three", 4: "four", 5: "five", 6: "six", 7: "seven", 8: "eight", 9: "nine"}
# num = input()
# for n in num:
#     print(nums[int(n)], end=" ")

#  -------------------------------------------------------------------------------------------------
#  TASK 098 (Информация об учебных курсах)
#  -------------------------------------------------------------------------------------------------
#  Напишите программу, которая по номеру курса выводит информацию о данном курсе.
#  Номер курса (ключ)	Номер аудитории (значение)	Преподаватель (значение)	Время (значение)
#  CS101	                   3004	                        Хайнс	                  8:00
#  CS102	                   4501	                       Альварадо	              9:00
#  CS103	                   6755	                          Рич	                 10:00
#  NT110	                   1244	                          Берк	                 11:00
#  CM241	                   1411	                           Ли	                 13:00
#  -------------------------------------------------------------------------------------------------

# courses = {'CS101': [3004, 'Хайнс', '8:00'],
#            'CS102': [4501, 'Альварадо', '9:00'],
#            'CS103': [6755, 'Рич', '10:00'],
#            'NT110': [1244, 'Берк', '11:00'],
#            'CM241': [1411, 'Ли', '13:00']}
# c = input()
# print(f"{c}: {courses[c][0]}, {courses[c][1]}, {courses[c][2]}")

#  -------------------------------------------------------------------------------------------------
#  TASK 099 (Набор сообщений)
#  -------------------------------------------------------------------------------------------------
#  На мобильных кнопочных телефонах текстовые сообщения можно отправлять с помощью цифровой клавиатуры.
#  Поскольку с каждой клавишей связано несколько букв, для большинства букв требуется несколько нажатий клавиш.
#  При однократном нажатии цифры генерируется первый символ, указанный для этой клавиши. Нажатие цифры 2, 3, 4
#  или 5 раз генерирует второй, третий, четвертый или пятый символ клавиши.
#  1	.,?!: 2	ABC 3	DEF 4	GHI 5	JKL 6	MNO 7	PQRS 8	TUV 9	WXYZ 0	space (пробел)
#  -------------------------------------------------------------------------------------------------

# d = {".": '1', ",": '11', "?": '111', "!": '1111', ":": '11111', "A": '2', "B": '22', "C": '222', "D": '3', "E": '33',
#      "F": '333', "G": '4', "H": '44', "I": '444', "J": '5', "K": '55', "L": '555', "M": '6', "N": '66', "O": '666',
#      "P": '7', "Q": '77', "R": '777', "S": '7777', "T": '8', "U": '88', "V": '888', "W": '9', "X": '99', "Y": '999',
#      "Z": '9999', " ": '0'}
# txt = input()
# for c in txt:
#     if c.upper() in d:
#         print(d[c.upper()], end='')

#  -------------------------------------------------------------------------------------------------
#  TASK 100 (Код Морзе)
#  -------------------------------------------------------------------------------------------------
#  Код Морзе для представления цифр и букв использует тире и точки.
#  Напишите программу для кодирования текстового сообщения в соответствии с кодом Морзе.
#  -------------------------------------------------------------------------------------------------

# morze = {'A': '.-', 'B': '-...', 'C': '-.-.', 'D': '-..', 'E': '.', 'F': '..-.', 'G': '--.', 'H': '....', 'I': '..',
#          'J': '.---', 'K': '-.-', 'L': '.-..', 'M': '--', 'N': '-.', 'O': '---', 'P': '.--.', 'Q': '--.-', 'R': '.-.',
#          'S': '...', 'T': '-', 'U': '..-', 'V': '...-', 'W': '.--', 'X': '-..-', 'Y': '-.--', 'Z': '--..',
#          '0': '-----', '1': '.----', '2': '..---', '3': '...--', '4': '....-', '5': '.....', '6': '-....',
#          '7': '--...', '8': '---..', '9': '----.'}
# txt = input()
# for c in txt:
#     if c.upper() in morze:
#         print(morze[c.upper()], end=' ')

#  -------------------------------------------------------------------------------------------------
#  TASK 101 (Самое редкое слово)
#  -------------------------------------------------------------------------------------------------
#  На вход программе подается строка текста. Напишите программу, которая выводит слово, которое встречается реже всего,
#  без учета регистра. Если таких слов несколько, выведите то, которое меньше в лексикографическом порядке.
#  -------------------------------------------------------------------------------------------------

# words = [i.lower().strip('.,!?:;-') for i in input().split()]
# res = {}
# for w in words:
#     res[w] = res.get(w, 0) + 1
# print(sorted([i[0] for i in res.items() if i[1] == min(res.values())])[0])

#  -------------------------------------------------------------------------------------------------
#  TASK 102 (Исправление дубликатов)
#  -------------------------------------------------------------------------------------------------
#  На вход программе подается строка, содержащая строки-идентификаторы. Напишите программу, которая исправляет их так,
#  чтобы в результирующей строке не было дубликатов. Для этого необходимо прибавлять к повторяющимся идентификаторам
#  постфикс _n, где n – количество раз, сколько такой идентификатор уже встречался.
#  -------------------------------------------------------------------------------------------------

# ids, dict_ids, res = input().split(), {}, ''
# for i in ids:
#     dict_ids.setdefault(i, 0)
# for i in ids:
#     if dict_ids[i] == 0:
#         res += f'{i} '
#         dict_ids[i] += 1
#     else:
#         res += f"{i}_{dict_ids[i]} "
#         dict_ids[i] += 1
# print(res)
