#  -------------------------------------------------------------------------------------------------
#  TASK 067 (Количество различных символов)
#  -------------------------------------------------------------------------------------------------
#  На вход программе подается строка текста. Напишите программу,
#  которая определяет количество различных символов в строке.
#  -------------------------------------------------------------------------------------------------

# my_set = set(input())
# print(len(my_set))

#  -------------------------------------------------------------------------------------------------
#  TASK 068 (Неповторимые цифры)
#  -------------------------------------------------------------------------------------------------
#  На вход программе подается строка, состоящая из цифр. Необходимо определить, верно ли,
#  что в ее записи ни одна из цифр не повторяется?
#  -------------------------------------------------------------------------------------------------

# nums = input()
# set_nums = set(nums)
# if len(nums) == len(set_nums):
#     print("YES")
# else:
#     print("NO")

#  -------------------------------------------------------------------------------------------------
#  TASK 069 (Все 10 цифр)
#  -------------------------------------------------------------------------------------------------
#  На вход программе подаются две строки, состоящие из цифр. Необходимо определить, верно ли,
#  что в записи этих двух строк используются все десять цифр?
#  -------------------------------------------------------------------------------------------------

# print("YES" if set(input()+input()) == set("0123456789") else "NO")

#  -------------------------------------------------------------------------------------------------
#  TASK 070 (Одинаковые наборы)
#  -------------------------------------------------------------------------------------------------
#  На вход программе подаются две строки, состоящие из цифр. Необходимо определить, верно ли,
#  что для записи этих строк были использованы одинаковые наборы цифр?
#  -------------------------------------------------------------------------------------------------

# print("YES" if set(input()) == set(input()) else "NO")

#  -------------------------------------------------------------------------------------------------
#  TASK 071 (Три слова)
#  -------------------------------------------------------------------------------------------------
#  На вход программе подается строка, состоящая из трех слов. Верно ли,
#  что для записи всех трех слов был использован один и тот же набор букв?
#  -------------------------------------------------------------------------------------------------

# txt = input().split()
# print("YES" if set(txt[0]) == set(txt[0]) and set(txt[0]) == set(txt[2])  else "NO")
