#  -------------------------------------------------------------------------------------------------
#  TASK 072 (Уникальные символы 1)
#  -------------------------------------------------------------------------------------------------
#  Напишите программу для вывода количества уникальных символов каждого считанного слова без учета регистра.
#  -------------------------------------------------------------------------------------------------

# for _ in range(int(input())):
#     print(len(set(input().upper())))

#  -------------------------------------------------------------------------------------------------
#  TASK 073 (Уникальные символы 2)
#  -------------------------------------------------------------------------------------------------
#  Напишите программу для вывода общего количества уникальных символов во всех считанных словах без учета регистра.
#  -------------------------------------------------------------------------------------------------

# myset = set()
# for _ in range(int(input())):
#     for c in input():
#         myset.add(c.upper())
# print(len(myset))

#  -------------------------------------------------------------------------------------------------
#  TASK 074 (Количество слов в тексте)
#  -------------------------------------------------------------------------------------------------
#  Напишите программу для определения общего количества различных слов в строке текста.
#  -------------------------------------------------------------------------------------------------

# txt = input().split()
# for i in range(len(txt)):
#     txt[i] = txt[i].strip(".,;:-?-!").lower()
# print(len(set(txt)))

#  -------------------------------------------------------------------------------------------------
#  TASK 075 (Встречалось ли число раньше?)
#  -------------------------------------------------------------------------------------------------
#  На вход программе подается строка текста, содержащая числа. Для каждого числа выведите слово
#  YES (в отдельной строке), если это число ранее встречалось в последовательности или NO, если не встречалось.
#  -------------------------------------------------------------------------------------------------

# nums = [int(i) for i in input().split()]
# set_nums = set()
# for n in nums:
#     if n in set_nums:
#         print("YES")
#     else:
#         set_nums.add(n)
#         print("NO")

#  -------------------------------------------------------------------------------------------------
#  TASK 076 (Количество совпадающих)
#  -------------------------------------------------------------------------------------------------
#  На вход программе подаются две строки текста, содержащие числа. Напишите программу,
#  которая определяет количество чисел, которые есть как в первой строке, так и во второй.
#  -------------------------------------------------------------------------------------------------

# txt1, txt2 = set(input().split()), set(input().split())
# print(len(txt1.intersection(txt2)))

#  -------------------------------------------------------------------------------------------------
#  TASK 077 (Общие числа)
#  -------------------------------------------------------------------------------------------------
#  На вход программе подаются две строки текста, содержащие числа. Напишите программу,
#  которая выводит все числа в порядке возрастания, которые есть как в первой строке, так и во второй.
#  -------------------------------------------------------------------------------------------------

# print(*sorted(set([int(i) for i in input().split()]).intersection([int(i) for i in input().split()])))

#  -------------------------------------------------------------------------------------------------
#  TASK 078 (Числа первой строки)
#  -------------------------------------------------------------------------------------------------
#  На вход программе подаются две строки текста, содержащие числа. Напишите программу,
#  которая выводит все числа в порядке возрастания, которые есть в первой строке, но отсутствуют во второй.
#  -------------------------------------------------------------------------------------------------

# print(*sorted(set([int(i) for i in input().split()]).difference([int(i) for i in input().split()])))

#  -------------------------------------------------------------------------------------------------
#  TASK 079 (Общие цифры)
#  -------------------------------------------------------------------------------------------------
#  На вход программе подается натуральное число n, а затем nn различных натуральных чисел, каждое на отдельной строке.
#  Напишите программу, которая выводит все общие цифры в порядке возрастания у всех введенных чисел.
#  -------------------------------------------------------------------------------------------------

# n = int(input())
# set_nums = set([int(i) for i in input()])
# for _ in range(n-1):
#     set_nums.intersection_update([int(i) for i in input()])
# print(*sorted(set_nums))

#  -------------------------------------------------------------------------------------------------
#  TASK 080 (Одинаковые цифры)
#  -------------------------------------------------------------------------------------------------
#  На вход программе подаются два числа. Напишите программу, определяющую, есть ли в данных числах одинаковые цифры.
#  -------------------------------------------------------------------------------------------------

# print("NO" if set(input()).isdisjoint(set(input())) else "YES")

#  -------------------------------------------------------------------------------------------------
#  TASK 081 (Все цифры)
#  -------------------------------------------------------------------------------------------------
#  На вход программе подаются два числа. Напишите программу, которая определяет,
#  входят ли в запись первого числа все цифры, содержащиеся в записи второго
#  (независимо от повтора, то есть количества цифр) числа или нет.
#  -------------------------------------------------------------------------------------------------

# print("YES" if set(input()).issuperset(set(input())) else "NO")

#  -------------------------------------------------------------------------------------------------
#  TASK 082 (Урок информатики)
#  -------------------------------------------------------------------------------------------------
#  Даны по 10-балльной шкале оценки по информатике трех учеников. Напишите программу, которая выводит множество оценок,
#  которые есть и у первого и у второго учеников, но которых нет у третьего ученика.
#  -------------------------------------------------------------------------------------------------

# set1 = set([int(i) for i in input().split()])
# set2 = set([int(i) for i in input().split()])
# set3 = set([int(i) for i in input().split()])
# set1.intersection_update(set2)
# print(*sorted(set1 - set3, reverse=True))

#  -------------------------------------------------------------------------------------------------
#  TASK 083 (Урок математики)
#  -------------------------------------------------------------------------------------------------
#  Даны по 10-балльной шкале оценки по математике трех учеников. Напишите программу, которая выводит множество оценок,
#  имеющихся у учеников, которые встречаются не более, чем у двух из указанных учеников.
#  -------------------------------------------------------------------------------------------------

# set1 = set([int(i) for i in input().split()])
# set2 = set([int(i) for i in input().split()])
# set3 = set([int(i) for i in input().split()])
# res = set1.intersection(set2).intersection(set3)
# res = set1.union(set2).union(set3) - res
# print(*sorted(res))

#  -------------------------------------------------------------------------------------------------
#  TASK 084 (Урок физики)
#  -------------------------------------------------------------------------------------------------
#  Даны по 10-балльной шкале оценки по физике трех учеников. Напишите программу,
#  которая выводит множество оценок третьего ученика, которые не встречаются ни у первого, ни у второго ученика.
#  -------------------------------------------------------------------------------------------------

# set1 = set([int(i) for i in input().split()])
# set2 = set([int(i) for i in input().split()])
# set3 = set([int(i) for i in input().split()])
# print(*sorted(set3.difference(set1,set2), reverse=True))

#  -------------------------------------------------------------------------------------------------
#  TASK 085 (Урок биологии)
#  -------------------------------------------------------------------------------------------------
#  Даны по 10-балльной шкале оценки по биологии трех учеников. Напишите программу,
#  которая выводит множество оценок, не встречающихся ни у одного из трех учеников.
#  -------------------------------------------------------------------------------------------------

# set1 = set([int(i) for i in input().split()])
# set2 = set([int(i) for i in input().split()])
# set3 = set([int(i) for i in input().split()])
# set_base = {0, 1, 2 , 3, 4, 5, 6, 7, 8, 9, 10}
# print(*sorted(set_base - set1.union(set2, set3)))
