# ---------------------------------------------------------------------------------------------
# IF
# ---------------------------------------------------------------------------------------------
x = int(input('x = '))
# Если число x больше пяти, то будет выдано
# соответствующее сообщение
if x > 5:
    print('x больше пяти')
# ---------------------------------------------------------------------------------------------
# PASS
# ---------------------------------------------------------------------------------------------
value = None
# Синтаксис языка требует, чтобы в блоке был по крайней
# мере один оператор, поэтому существует специальный
# оператор pass, который не делает ничего и который можно
# использовать для разного рода заглушек, нереализованного
# функционала и т.п.
if value is not None:
    pass           # add some logic
# ---------------------------------------------------------------------------------------------
# IF ОДНОЙ СТРОКОЙ
# ---------------------------------------------------------------------------------------------
x = int(input('x = '))
# такая форма записи возможна, но нежелательна
if x < 0: x += 1
print(x)
# ---------------------------------------------------------------------------------------------
# IF ELSE
# ---------------------------------------------------------------------------------------------
x = int(input('x = '))
if x > 0:
    y = x ** 0.5
else:
    y = x ** 2
print(y)
# ---------------------------------------------------------------------------------------------
# ВЛОЖЕННЫЙ IF ELSE
# ---------------------------------------------------------------------------------------------
x = int(input('x = '))
if 0 < x < 7:
    print('Значение x входит в заданный диапазон, продолжаем')
    y = 2 * x - 5
    if y < 0:
        print('Значение y отрицательно')
    else:
        if y > 0:
            print('Значение y положительно')
        else:
            print('y = 0')
# ---------------------------------------------------------------------------------------------
# ELIF
# ---------------------------------------------------------------------------------------------
x = int(input('x = '))
# Заменим второй вложенный if в предыдущем примере
# на оператор ветвления с несколькими условиями
if 0 < x < 7:
    print('Значение x входит в заданный диапазон, продолжаем')
    y = 2 * x - 5
    if y < 0:
        print('Значение y отрицательно')
    elif y > 0:
        print('Значение y положительно')
    else:
        print('y = 0')
# ---------------------------------------------------------------------------------------------
# ELIF пример использования
# ---------------------------------------------------------------------------------------------
print('''Меню:
      1. Файл
      2. Вид
      3. Выход
''')
choice = int(input('Ваш выбор: '))
if choice == 1:
    print('Вы выбрали пункт меню "Файл"')
elif choice == 2:
    print('Вы открыли меню "Вид"')
elif choice == 3:
    print('Завершение.')
else:
    print('Некорректный выбор')
# ---------------------------------------------------------------------------------------------
# IF ELSE с булевым значением
# ---------------------------------------------------------------------------------------------
is_ready = True
# Присваиваем значение переменной в зависимости от условия
if is_ready:
    state_msg = 'Ready'
else:
    state_msg = 'Not ready yet'
print(state_msg)
# ---------------------------------------------------------------------------------------------
is_ready = True
# То же самое, что и в предыдущем примере, но используем
# условное выражение вместо условного оператора
state_msg = 'Ready' if is_ready else 'Not ready yet'
print(state_msg)
