# ---------------------------------------------------------------------------------------------
# WHILE
# ---------------------------------------------------------------------------------------------
# n = 1  # вначале n равно единице
# while n <= 10:  # пока оно меньше или равно десяти
#     print('n =', n)  # выводим текущее значение n
#     n += 1  # и увеличиваем его на 1
# ---------------------------------------------------------------------------------------------
# x = 0
# while x <= 0:  # повторять, пока x не будет положительным
#     x = int(input('Введите положительное число: '))
# print('Вы ввели число', x)
# x = 0
# ---------------------------------------------------------------------------------------------
# n = 1  # бесконечный цикл
# while True:
#     print(n)
#     n += 1
# ---------------------------------------------------------------------------------------------
# BREAK
# ---------------------------------------------------------------------------------------------
# name = None  # вначале мы не знаем имени пользователя
# while True:  # бесконечный цикл
#     print('Меню:', '1. Ввести имя', '2. Вывести приветствие', '3. Выйти', sep='\n')
#     response = input('Выберите пункт: ')
#     print()
#     if response == '1':
#         name = input('Введите ваше имя: ')
#     elif response == '2':
#         if name:  # здороваемся с пользователем, если имя уже введено
#             print('Привет, ', name, '!', sep='')
#         else:
#             print('Я не знаю вашего имени.')
#     elif response == '3':
#         break  # оператор break завершает выполнение цикла
#     else:
#         print('Неверный ввод.')
#     print()
# ---------------------------------------------------------------------------------------------
# CONTINUE
# ---------------------------------------------------------------------------------------------
# x = 0
# while x < 10:
#     x += 1
#     if x == 5:  # пропускаем число 5
#         continue
#     print('Текущее число равно', x)
# ---------------------------------------------------------------------------------------------
# WHILE ELSE
# ---------------------------------------------------------------------------------------------
# x = 3
# while x:  # цикл будет повторен три раза, если пользователь не завершит его ранее
#     x -= 1
#     response = input('Введите stop, чтобы остановить цикл (иначе что угодно): ')
#     if response == 'stop':
#         break
# else:
#     # эта ветка будет выполенена только если цикл не был прерван
#     print('Цикл завершился сам')
# print('Конец программы')
# ---------------------------------------------------------------------------------------------
# FOR
# ---------------------------------------------------------------------------------------------
# for i in range(10):  # i принимает значения в диапазоне [0, 10)
#     print('i =', i)
# ---------------------------------------------------------------------------------------------
# for i in range(5, 10):  # i принимает значения в диапазоне [5, 10)
#     print('i =', i)
# ---------------------------------------------------------------------------------------------
# for i in range(5, 10, 2):  # i принимает значения в диапазоне [5, 10) с шагом 2
#     print('i =', i)
# ---------------------------------------------------------------------------------------------
# FOR ELSE
# ---------------------------------------------------------------------------------------------
# for i in range(3):  # цикл будет повторен три раза, если пользователь не завершит его ранее
#     response = input('Введите stop, чтобы остановить цикл (иначе что угодно): ')
#     if response == 'stop':
#         break
# else:
#     # эта ветка будет выполенена только если цикл не был прерван
#     print('Цикл завершился сам')
# print('Конец программы')
# ---------------------------------------------------------------------------------------------
# FOR CONTINUE
# ---------------------------------------------------------------------------------------------
# for x in range(1, 11):
#     if x == 5:  # пропускаем число 5
#         continue
#     print('Текущее число равно', x)
# ---------------------------------------------------------------------------------------------
# FOR ВЛОЖЕННЫЙ
# ---------------------------------------------------------------------------------------------
# for i in range(10):
#     for j in range(30):
#         print('*', end='')
#     print()
