#  -------------------------------------------------------------------------------------------------
#  TASK 181 (Список чисел)
#  -------------------------------------------------------------------------------------------------
#   На вход программе подается одно число n. Напишите программу, которая выводит список [1,2,3,...,n]
#  -------------------------------------------------------------------------------------------------

# num = int(input())
# print(list(range(1, num + 1)))

#  -------------------------------------------------------------------------------------------------
#  TASK 182 (Список букв)
#  -------------------------------------------------------------------------------------------------
#   На вход программе подается одно число n. Напишите программу, которая выводит список,
#   состоящий из n букв английского алфавита ['a', 'b', 'c', ...] в нижнем регистре.
#  -------------------------------------------------------------------------------------------------

# num = int(input())
# text = ''
# for c in range(97, num + 97):
#   text += chr(c)
# print(list(text))

#  -------------------------------------------------------------------------------------------------
#  TASK 183 (Список строк)
#  -------------------------------------------------------------------------------------------------
#   На вход программе подается натуральное число n, а затем n строк.
#   Напишите программу, которая создает из указанных строк список и выводит его.
#  -------------------------------------------------------------------------------------------------

# num, arr = int(input()), []
# for i in range(num):
#     arr.append(input())
# print(arr)

#  -------------------------------------------------------------------------------------------------
#  TASK 184 (Алфавит)
#  -------------------------------------------------------------------------------------------------
#   Напишите программу, выводящую следующий список:
#  ['a', 'bb', 'ccc', 'dddd', 'eeeee', 'ffffff', ...]
#  -------------------------------------------------------------------------------------------------

# arr, j = [], 1
# for i in range(26):
#     arr.append(chr(ord('a') + i) * j)
#     j += 1
# print(arr)

#  -------------------------------------------------------------------------------------------------
#  TASK 185 (Список кубов)
#  -------------------------------------------------------------------------------------------------
#   На вход программе подается натуральное число n, а затем n целых чисел.
#   Напишите программу, которая создает из указанных чисел список их кубов.
#  -------------------------------------------------------------------------------------------------

# num, arr = int(input()), []
# for i in range(num):
#     arr.append(int(input()) ** 3)
# print(arr)

#  -------------------------------------------------------------------------------------------------
#  TASK 186 (Список делителей)
#  -------------------------------------------------------------------------------------------------
#   На вход программе подается натуральное число n. Напишите программу,
#   которая создает список состоящий из делителей введенного числа.
#  -------------------------------------------------------------------------------------------------

# num, arr = int(input()), []
# for i in range(1, num + 1):
#     if num % i == 0:
#         arr.append(i)
# print(arr)

#  -------------------------------------------------------------------------------------------------
#  TASK 187 (Суммы двух)
#  -------------------------------------------------------------------------------------------------
#   На вход программе подается натуральное число n≥2, а затем n целых чисел.
#   Напишите программу, которая создает из указанных чисел список, состоящий
#   из сумм соседних чисел (0 и 1, 1 и 2, 2 и 3 и т.д.).
#  -------------------------------------------------------------------------------------------------

# n, arr, num1, num2 = int(input()), [], 0, 0
# for i in range(n):
#     num1 = num2
#     num2 = int(input())
#     arr.append(num1 + num2)
# del arr[0]
# print(arr)

#  -------------------------------------------------------------------------------------------------
#  TASK 188 (Удалите нечетные индексы)
#  -------------------------------------------------------------------------------------------------
#   На вход программе подается натуральное число n, а затем n целых чисел.
#   Напишите программу, которая создает из указанных чисел список,
#   затем удаляет все элементы стоящие по нечетным индексам, а затем выводит полученный список.
#  -------------------------------------------------------------------------------------------------

# n, arr = int(input()), []
# for i in range(n):
#     arr.append(int(input()))
# del arr[1::2]
# print(arr)

#  -------------------------------------------------------------------------------------------------
#  TASK 189 (k-ая буква слова)
#  -------------------------------------------------------------------------------------------------
#   На вход программе подается натуральное число n и n строк, а затем число k.
#   Напишите программу, которая выводит k-ую букву из введенных строк на одной строке без пробелов.
#  -------------------------------------------------------------------------------------------------

# num, arr = int(input()), []
# for i in range(num):
#     arr.append(input())
# k = int(input())
# for i in range(num):
#     if len(arr[i]) >= 3 and k <= len(arr[i]):
#          print(arr[i][k-1], end='')

#  -------------------------------------------------------------------------------------------------
#  TASK 190 (Символы всех строк)
#  -------------------------------------------------------------------------------------------------
#   На вход программе подается натуральное число n, а затем n строк.
#   Напишите программу, которая создает список из символов всех строк, а затем выводит его.
#  -------------------------------------------------------------------------------------------------

# n, arr = int(input()), []
# for i in range(n):
#     arr.extend(input())
# print(arr)

#  -------------------------------------------------------------------------------------------------
#  TASK 191 (Значение функции)
#  -------------------------------------------------------------------------------------------------
#   На вход программе подается натуральное число n, а затем nn целых чисел. Напишите программу,
#   которая для каждого введенного числа x выводит значение функции f(x) = x^2 + 2x + 1, каждое на отдельной строке.
#  -------------------------------------------------------------------------------------------------

# n, arr = int(input()), []
# for i in range(n):
#     arr.append(int(input()))
# print(*arr, sep="\n")
# print()
# for i in range(n):
#     print(arr[i] ** 2 + 2 * arr[i] + 1)

#  -------------------------------------------------------------------------------------------------
#  TASK 192 (Remove outliers)
#  -------------------------------------------------------------------------------------------------
#   На вход программе подается натуральное число n, а затем n различных натуральных чисел.
#   Напишите программу, которая удаляет наименьшее и наибольшее значение из указанных чисел,
#   а затем выводит оставшиеся числа каждое на отдельной строке, не меняя их порядок.
#  -------------------------------------------------------------------------------------------------

# num, arr = int(input()), []
# for i in range(num):
#     arr.append(int(input()))
# arr.remove(max(arr))
# arr.remove(min(arr))
# print(*arr, sep="\n")

#  -------------------------------------------------------------------------------------------------
#  TASK 193 (Без дубликатов)
#  -------------------------------------------------------------------------------------------------
#   На вход программе подается натуральное число n, а затем n строк.
#   Напишите программу, которая выводит только уникальные строки, в том же порядке, в котором они были введены.
#  -------------------------------------------------------------------------------------------------

# num, arr = int(input()), []
# for i in range(num):
#     temp = input()
#     if temp in arr:
#         continue
#     else:
#         arr.append(temp)
# print(*arr, sep="\n")

#  -------------------------------------------------------------------------------------------------
#  TASK 194 (Google search - 1)
#  -------------------------------------------------------------------------------------------------
#   На вход программе подается натуральное число n, затем n строк, затем еще одна строка — поисковый запрос.
#   Напишите программу, которая выводит все введенные строки, в которых встречается поисковый запрос.
#  -------------------------------------------------------------------------------------------------

# num, arr = int(input()), []
# for i in range(num):
#     arr.append(input())
# search = input()
# for i in range(num):
#     if search.lower() in arr[i].lower():
#         print(arr[i])

#  -------------------------------------------------------------------------------------------------
#  TASK 195 (Google search - 2)
#  -------------------------------------------------------------------------------------------------
#   На вход программе подается натуральное число n, затем nn строк, затем число k — количество поисковых запросов,
#   затем k строк — поисковые запросы. Напишите программу, которая выводит все введенные строки,
#   в которых встречаются все поисковые запросы.
#  -------------------------------------------------------------------------------------------------

# n, arr = int(input()), []
# for i in range(n):
#     arr.append(input())
# k, searches = int(input()), []
# for i in range(k):
#     searches.append(input())
# for i in range(n):
#     flag = True
#     for j in range(k):
#         if searches[j].lower() not in arr[i].lower():
#             flag = False
#     if flag:
#         print(arr[i])

#  -------------------------------------------------------------------------------------------------
#  TASK 196 (Negatives, Zeros and Positives)
#  -------------------------------------------------------------------------------------------------
#   На вход программе подается натуральное число n, а затем n целых чисел. Напишите программу,
#   которая сначала выводит все отрицательные числа, затем нули, а затем все положительные числа,
#   каждое на отдельной строке. Числа должны быть выведены в том же порядке, в котором они были введены.
#  -------------------------------------------------------------------------------------------------

# n, neg, zer, pos = int(input()), [], [], []
# for i in range(n):
#     temp = int(input())
#     if temp < 0:
#         neg.append(temp)
#     elif temp == 0:
#         zer.append(temp)
#     else:
#         pos.append(temp)
# print(*neg, sep="\n")
# print(*zer, sep="\n")
# print(*pos, sep="\n")
