#  -------------------------------------------------------------------------------------------------
#  TASK 043 (Шахматная доска)
#  -------------------------------------------------------------------------------------------------
#  На вход программе подаются два натуральных числа n и m. Напишите программу для создания матрицы размером n×m,
#  заполнив её символами . и * в шахматном порядке. В левом верхнем углу должна стоять точка.
#  Выведите полученную матрицу на экран, разделяя элементы пробелами.
#  -------------------------------------------------------------------------------------------------

# row_col, arr, flag = [int(i) for i in input().split()], [], True
# for i in range(row_col[0]):
#     arr.append([])
#     for j in range(row_col[1]):
#         if flag:
#             arr[i].append(".")
#         else:
#             arr[i].append("*")
#         if row_col[1] > 1:
#             flag = not flag
#     flag = not flag
# for i in range(row_col[0]):
#     for j in range(row_col[1]):
#         print(arr[i][j], end=" ")
#     print()

#  -------------------------------------------------------------------------------------------------
#  TASK 044 (Побочная диагональ)
#  -------------------------------------------------------------------------------------------------
#  На вход программе подается натуральное число n. Напишите программу,
#  которая создает матрицу размером n×n и заполняет её по следующему правилу: числа на побочной диагонали равны 1;
#  числа, стоящие выше этой диагонали, равны 0; числа, стоящие ниже этой диагонали, равны 2.
#  Полученную матрицу выведите на экран. Числа в строке разделяйте одним пробелом.
#  -------------------------------------------------------------------------------------------------

# n, arr = int(input()), []
# for i in range(n):
#     arr.append([])
#     for j in range(n):
#         if j == n - i - 1:
#             arr[i].append(1)
#         elif (i > j and i > n - j - 1) or (i < j and i > n - 1 - j) or (i >= n / 2 and j >= n / 2):
#             arr[i].append(2)
#         else:
#             arr[i].append(0)
# for i in range(n):
#     for j in range(n):
#         print(arr[i][j], end=" ")
#     print()

#  -------------------------------------------------------------------------------------------------
#  TASK 045 (Заполнение 1)
#  -------------------------------------------------------------------------------------------------
#  На вход программе подаются два натуральных числа n и m. Напишите программу,
#  которая создает матрицу размером ×m и заполняет её числами от 1 до n*m в соответствии с образцом.
#  -------------------------------------------------------------------------------------------------

# nm, num, arr = [int(i) for i in input().split()], 1, []
# for i in range(nm[0]):
#     arr.append([])
#     for j in range(nm[1]):
#         arr[i].append(num)
#         num += 1
# for i in range(nm[0]):
#     for j in range(nm[1]):
#         print(str(arr[i][j]).ljust(3), end=" ")
#     print()

#  -------------------------------------------------------------------------------------------------
#  TASK 046 (Заполнение 2)
#  -------------------------------------------------------------------------------------------------
#  На вход программе подаются два натуральных числа n и m. Напишите программу,
#  которая создает матрицу размером n×m заполнив её в соответствии с образцом.
#  1  4  7
#  2  5  8
#  3  6  9
#  -------------------------------------------------------------------------------------------------

# nm, num, arr = [int(i) for i in input().split()], 1, []
# for i in range(nm[0]):
#     arr.append([])
# for i in range(nm[1]):
#     for j in range(nm[0]):
#         arr[j].append(num)
#         num += 1
# for i in range(nm[0]):
#     for j in range(nm[1]):
#         print(str(arr[i][j]).ljust(3), end=" ")
#     print()

#  -------------------------------------------------------------------------------------------------
#  TASK 047 (Заполнение 3)
#  -------------------------------------------------------------------------------------------------
#  На вход программе подается натуральное число n. Напишите программу,
#  которая создает матрицу размером n×n заполнив её в соответствии с образцом.
#  1  0  0  1
#  0  1  1  0
#  0  1  1  0
#  1  0  0  1
#  -------------------------------------------------------------------------------------------------

# n, arr = int(input()), []
# for i in range(n):
#     arr.append([0] * n)
# for i in range(n):
#     for j in range(n):
#         if i == j or j == n - i - 1:
#             arr[i][j] = 1
# for i in range(n):
#     for j in range(n):
#         print(str(arr[i][j]).ljust(3), end=" ")
#     print()

#  -------------------------------------------------------------------------------------------------
#  TASK 048 (Заполнение 4)
#  -------------------------------------------------------------------------------------------------
#  На вход программе подается натуральное число n. Напишите программу,
#  которая создает матрицу размером n×n заполнив её в соответствии с образцом.
#  1  1  1  1  1
#  0  1  1  1  0
#  0  0  1  0  0
#  0  1  1  1  0
#  1  1  1  1  1
#  -------------------------------------------------------------------------------------------------

# n, arr = int(input()), []
# for i in range(n):
#     arr.append([1] * n)
# for i in range(n):
#     for j in range(n):
#         if (i > j) and (i < n - 1 - j) or (i < j) and (i > n - 1 - j):
#             arr[i][j] = 0
# for i in range(n):
#     for j in range(n):
#         print(str(arr[i][j]).ljust(3), end=" ")
#     print()

#  -------------------------------------------------------------------------------------------------
#  TASK 049 (Заполнение 5)
#  -------------------------------------------------------------------------------------------------
#  На вход программе подаются два натуральных числа n и m. Напишите программу,
#  которая создает матрицу размером n×m заполнив её в соответствии с образцом.
#  5 5
#  1 2 3 4 5
#  2 3 4 5 1
#  3 4 5 1 2
#  4 5 1 2 3
#  5 1 2 3 4
#  -------------------------------------------------------------------------------------------------

# nm, arr, nums = [int(i) for i in input().split()], [], []
# for i in range(nm[0]):
#     arr.append([0] * nm[1])
# for i in range(nm[0]):
#     for j in range(nm[1]):
#         arr[i][j] = (i + j) % nm[1] + 1
# for i in range(nm[0]):
#     for j in range(nm[1]):
#         print(str(arr[i][j]).ljust(3), end=" ")
#     print()

#  -------------------------------------------------------------------------------------------------
#  TASK 050 (Заполнение змейкой)
#  -------------------------------------------------------------------------------------------------
#  На вход программе подаются два натуральных числа n и m. Напишите программу,
#  которая создает матрицу размером n×m заполнив её "змейкой" в соответствии с образцом.
#  3 5
#  1  2  3  4  5
#  10 9  8  7  6
#  11 12 13 14 15
#  -------------------------------------------------------------------------------------------------

# n, m = [int(i) for i in input().split()]
# arr, num = [], 1
# for i in range(n):
#     arr.append([])
#     for j in range(m):
#         arr[i].append(num)
#         num += 1
# for i in range(1, n, 2):
#     arr[i].reverse()
# for i in range(n):
#     for j in range(m):
#         print(str(arr[i][j]).ljust(3), end=" ")
#     print()

#  -------------------------------------------------------------------------------------------------
#  TASK 051 (Заполнение змейкой)
#  -------------------------------------------------------------------------------------------------
#  На вход программе подаются два натуральных числа n и m. Напишите программу,
#  которая создает матрицу размером n×m заполнив её "диагоналями" в соответствии с образцом.
#  1  2  4  7  10
#  3  5  8  11 13
#  6  9  12 14 15
#  -------------------------------------------------------------------------------------------------

# n, m = [int(i) for i in input().split()]
# arr, num = [], 1
# for i in range(n):
#     arr.append([0] * m)
# for k in range(n + m - 1):
#     for i in range(n):
#         for j in range(m):
#             if i + j == k:
#                 arr[i][j] = num
#                 num += 1
# for i in range(n):
#     for j in range(m):
#         print(str(arr[i][j]).ljust(3), end=" ")
#     print()

#  -------------------------------------------------------------------------------------------------
#  TASK 052 (Заполнение спиралью)
#  -------------------------------------------------------------------------------------------------
#  На вход программе подаются два натуральных числа n и m. Напишите программу,
#  которая создает матрицу размером n×m заполнив её "спиралью" в соответствии с образцом.
#  1  2  3  4  5
#  14 15 16 17 6
#  13 20 19 18 7
#  12 11 10 9  8
#  -------------------------------------------------------------------------------------------------

# n, m = [int(i) for i in input().split()]
# arr, num = [], 1
# for i in range(n):
#     arr.append([0] * m)
# row, col, go_row, go_col = 0, -1, 0, 1
# while num <= n * m:
#     if 0 <= row + go_row < n and 0 <= col + go_col < m and arr[row + go_row][col + go_col] == 0:
#         row += go_row
#         col += go_col
#         arr[row][col] = num
#         num += 1
#     else:
#         if go_col == 1:
#             go_col = 0
#             go_row = 1
#         elif go_row == 1:
#             go_col = -1
#             go_row = 0
#         elif go_col == -1:
#             go_col = 0
#             go_row = -1
#         else:
#             go_col = 1
#             go_row = 0
# for i in range(n):
#     for j in range(m):
#         print(str(arr[i][j]).ljust(3), end=" ")
#     print()
