#  -------------------------------------------------------------------------------------------------
#  TASK 001 (Здравствуй, мир!)
#  -------------------------------------------------------------------------------------------------
#  Напишите программу, которая выводит на экран текст «Здравствуй, мир!» (без кавычек).
#  -------------------------------------------------------------------------------------------------

# print('Здравствуй, мир!')

#  -------------------------------------------------------------------------------------------------
#  TASK 002 (Счастливая последовательность 1)
#  -------------------------------------------------------------------------------------------------
#  В популярном сериале «Остаться в живых» использовалась последовательность чисел 4 8 15 16 23 42,
#  которая принесла героям удачу и помогла сорвать джекпот в лотерее.
#  Напишите программу, которая выводит данную последовательность чисел с одним пробелом между ними.
#  Примечание. Текст '4 8 15 16 23 42' не использовать.
#  Воспользуйтесь возможностью команды print() выводить несколько аргументов, указанных через запятую.
#  -------------------------------------------------------------------------------------------------

# print(4, 8, 15, 16, 23, 42)

#  -------------------------------------------------------------------------------------------------
#  TASK 003 (Счастливая последовательность 2)
#  -------------------------------------------------------------------------------------------------
#  Измените предыдущую программу так,
#  чтобы каждое число последовательности 4 8 15 16 23 42 печаталось на отдельной строке.
#  -------------------------------------------------------------------------------------------------

# print(4, 8, 15, 16, 23, 42, sep='\n')

#  -------------------------------------------------------------------------------------------------
#  TASK 004 (Звездный треугольник)
#  -------------------------------------------------------------------------------------------------
#  Напишите программу, которая выводит указанный треугольник, состоящий из звездочек (*).
#  -------------------------------------------------------------------------------------------------

# for i in range(8):
#     print("*" * i)

#  -------------------------------------------------------------------------------------------------
#  TASK 005 (Приветствие)
#  -------------------------------------------------------------------------------------------------
#  На вход программе подается строка текста – имя человека. Напишите программу,
#  которая выводит на экран приветствие в виде слова «Привет» (без кавычек),
#  после которого должна стоять запятая и пробел, а затем введенное имя.
#  -------------------------------------------------------------------------------------------------

# name = input()
# print("Привет,", name)

#  -------------------------------------------------------------------------------------------------
#  TASK 006 (Любимая команда)
#  -------------------------------------------------------------------------------------------------
#  На вход программе подается строка текста – название футбольной команды.
#  Напишите программу, которая повторяет ее на экране со словами « - чемпион!» (без кавычек).
#  -------------------------------------------------------------------------------------------------

# city = input()
# print(city, "- чемпион!")

#  -------------------------------------------------------------------------------------------------
#  TASK 007 (Повторяй за мной)
#  -------------------------------------------------------------------------------------------------
#  Напишите программу, которая считывает три строки по очереди,
#  а затем выводит их в той же последовательности, каждую на отдельной строчке.
#  -------------------------------------------------------------------------------------------------

# one, two, three = input(), input(), input()
# print(one, two, three, sep='\n')

#  -------------------------------------------------------------------------------------------------
#  TASK 008 (Повторяй за мной 2)
#  -------------------------------------------------------------------------------------------------
#  Напишите программу, которая считывает три строки по очереди,
#  а затем выводит их в обратной последовательности, каждую на отдельной строчке.
#  -------------------------------------------------------------------------------------------------

# one, two, three = input(), input(), input()
# print(three, two, one, sep='\n')

#  -------------------------------------------------------------------------------------------------
#  TASK 009 (I like Python)
#  -------------------------------------------------------------------------------------------------
#  Напишите программу, которая выводит на экран текст «I***like***Python» (без кавычек).
#  -------------------------------------------------------------------------------------------------

# print("I", "like", "Python", sep="***")

#  -------------------------------------------------------------------------------------------------
#  TASK 010 (Кастомный разделитель)
#  -------------------------------------------------------------------------------------------------
#  Напишите программу, которая считывает строку-разделитель и три строки,
#  а затем выводит указанные строки через разделитель.
#  -------------------------------------------------------------------------------------------------

# sep, one, two, three = input(), input(), input(), input()
# print(one, two, three, sep=sep)

#  -------------------------------------------------------------------------------------------------
#  TASK 011 (Приветствие)
#  -------------------------------------------------------------------------------------------------
#  Напишите программу, которая приветствует пользователя, выводя слово «Привет» (без кавычек),
#  после которого должна стоять запятая и пробел, а затем введенное имя и восклицательный знак.
#  -------------------------------------------------------------------------------------------------

# print("Привет,", input(), end="!")
