#  -------------------------------------------------------------------------------------------------
#  TASK 30 (Звездный прямоугольник)
#  -------------------------------------------------------------------------------------------------
#  Напишите программу, которая выводит прямоугольник, по периметру состоящий из звездочек (*).
#  -------------------------------------------------------------------------------------------------

# print("*****************")
# print("*               *")
# print("*               *")
# print("*****************")

#  -------------------------------------------------------------------------------------------------
#  TASK 31 (Сумма квадратов VS квадрат суммы)
#  -------------------------------------------------------------------------------------------------
#  Напишите программу, которая считывает два целых числа aa и bb и выводит на экран квадрат суммы
#  и сумму квадратов этих чисел.
#  -------------------------------------------------------------------------------------------------

# a = int(input())
# b = int(input())
# print("Квадрат суммы", a, "и", b, "равен", (a + b) ** 2)
# print("Сумма квадратов", a, "и", b, "равна", a ** 2 + b ** 2)

#  -------------------------------------------------------------------------------------------------
#  TASK 32 (Большое число)
#  -------------------------------------------------------------------------------------------------
#  Как известно, целые числа в языке Python не имеют ограничений, которые встречаются в других языках программирования.
#  Напишите программу, которая считывает четыре целых положительных числа и выводит
#  на экран значение выражения a**b+c**d
#  -------------------------------------------------------------------------------------------------

# a, b, c, d = int(input()), int(input()), int(input()), int(input())
# print(a ** b + c ** d)

#  -------------------------------------------------------------------------------------------------
#  TASK 33 (Размножение n-ок)
#  -------------------------------------------------------------------------------------------------
#  Напишите программу, которая считывает целое положительное число n [1:9] и выводит значение числа
#  n + nn + nnn....
#  -------------------------------------------------------------------------------------------------

# num = int(input())
# print(num * 123)

