#  -------------------------------------------------------------------------------------------------
#  TASK 117 (До КОНЦА 1)
#  -------------------------------------------------------------------------------------------------
#  На вход программе подается последовательность слов, каждое слово на отдельной строке.
#  Концом последовательности является слово «КОНЕЦ» (без кавычек).
#  Напишите программу, которая выводит члены данной последовательности.
#  -------------------------------------------------------------------------------------------------

# word = input()
# while word != "КОНЕЦ":
#     print(word)
#     word = input()

#  -------------------------------------------------------------------------------------------------
#  TASK 118 (До КОНЦА 2)
#  -------------------------------------------------------------------------------------------------
#  На вход программе подается последовательность слов, каждое слово на отдельной строке.
#  Концом последовательности является слово «КОНЕЦ» или «конец» (большими или маленькими буквами, без кавычек).
#  Напишите программу, которая выводит члены данной последовательности.
#  -------------------------------------------------------------------------------------------------

# word = input()
# while word != "КОНЕЦ" and word != "конец":
#     print(word)
#     word = input()

#  -------------------------------------------------------------------------------------------------
#  TASK 119 (Количество членов)
#  -------------------------------------------------------------------------------------------------
#  На вход программе подается последовательность слов, каждое слово на отдельной строке.
#  Концом последовательности является одно из трех слов: «стоп», «хватит», «достаточно»
#  (маленькими буквами, без кавычек). Напишите программу,
#  которая выводит общее количество членов данной последовательности.
#  -------------------------------------------------------------------------------------------------

# word, counter = input(), 0
# while word != "стоп" and word != "хватит" and word != "достаточно":
#     word = input()
#     counter += 1
# print(counter)

#  -------------------------------------------------------------------------------------------------
#  TASK 120 (Пока делимся)
#  -------------------------------------------------------------------------------------------------
#  На вход программе подается последовательность целых чисел делящихся на 7, каждое число на отдельной строке.
#  Концом последовательности является любое число не делящееся на 7. Напишите программу,
#  которая выводит члены данной последовательности.
#  -------------------------------------------------------------------------------------------------

# num = int(input())
# while num % 7 == 0:
#     print(num)
#     num = int(input())

#  -------------------------------------------------------------------------------------------------
#  TASK 121 (Сумма чисел)
#  -------------------------------------------------------------------------------------------------
#  На вход программе подается последовательность целых чисел, каждое число на отдельной строке.
#  Концом последовательности является любое отрицательное число. Напишите программу,
#  которая выводит сумму всех членов данной последовательности.
#  -------------------------------------------------------------------------------------------------

# num, total = int(input()), 0
# while num >= 0:
#     total += num
#     num = int(input())
# print(total)

#  -------------------------------------------------------------------------------------------------
#  TASK 122 (Количество пятерок)
#  -------------------------------------------------------------------------------------------------
#  На вход программе подается последовательность целых чисел от 1 до 5, характеризующее оценку ученика,
#  каждое число на отдельной строке. Концом последовательности является любое отрицательное число, либо число большее 5.
#  Напишите программу, которая выводит количество пятерок.
#  -------------------------------------------------------------------------------------------------

# num, counter = int(input()), 0
# while 0 <= num <= 5:
#     if num == 5:
#         counter += 1
#     num = int(input())
# print(counter)

#  -------------------------------------------------------------------------------------------------
#  TASK 123 (Ведьмаку заплатите чеканной монетой)
#  -------------------------------------------------------------------------------------------------
#  Всем известно, что ведьмак способен одолеть любых чудовищ, однако его услуги обойдутся недешево,
#  к тому же ведьмак не принимает купюры, он принимает только чеканные монеты.
#  В мире ведьмака существуют монеты с номиналами 1,5,10,25.
#  -------------------------------------------------------------------------------------------------

# num, counter = int(input()), 0
# counter += num // 25
# num = num % 25
# counter += num // 10
# num = num % 10
# counter += num // 5
# num = num % 5
# counter += num // 1
# print(counter)

#  -------------------------------------------------------------------------------------------------
#  TASK 124 (Обратный порядок 1)
#  -------------------------------------------------------------------------------------------------
#  Дано натуральное число. Напишите программу, которая выводит его цифры в столбик в обратном порядке.
#  -------------------------------------------------------------------------------------------------

# num = int(input())
# while num != 0:
#     print(num % 10)
#     num //= 10

#  -------------------------------------------------------------------------------------------------
#  TASK 125 (Обратный порядок 2)
#  -------------------------------------------------------------------------------------------------
#  Дано натуральное число. Напишите программу, которая меняет порядок цифр числа на обратный.
#  -------------------------------------------------------------------------------------------------

# num = int(input())
# while num != 0:
#     print(num % 10, end = '')
#     num //= 10

#  -------------------------------------------------------------------------------------------------
#  TASK 126 (max и min)
#  -------------------------------------------------------------------------------------------------
#  Дано натуральное число (n≥10). Напишите программу, которая определяет его максимальную и минимальную цифры.
#  -------------------------------------------------------------------------------------------------

# n = int(input())
# largest, smallest = n % 10, n % 10
# while n != 0:
#     if n % 10 > largest:
#         largest = n % 10
#     elif n % 10 < smallest:
#         smallest = n % 10
#     n //= 10
# print("Максимальная цифра равна", largest)
# print("Минимальная цифра равна", smallest)

#  -------------------------------------------------------------------------------------------------
#  TASK 127 (Все вместе)
#  -------------------------------------------------------------------------------------------------
#  Дано натуральное число. Напишите программу, которая вычисляет: сумму его цифр; количество цифр в нем;
#  произведение его цифр; среднее арифметическое его цифр; его первую цифру; сумму его первой и последней цифры.
#  -------------------------------------------------------------------------------------------------

# num, total, counter, multiple, first_digit = int(input()), 0, 0, 1, 0
# last_digit = num % 10
# while num != 0:
#     temp = num % 10
#     total += temp
#     counter += 1
#     multiple *= temp
#     first_digit = temp
#     num //= 10
# print(total, counter, multiple, total / counter, first_digit, first_digit + last_digit, sep = "\n")

#  -------------------------------------------------------------------------------------------------
#  TASK 128 (Вторая цифра)
#  -------------------------------------------------------------------------------------------------
#  Дано натуральное число (n>9). Напишите программу, которая определяет его вторую (с начала) цифру.
#  -------------------------------------------------------------------------------------------------

# num, last, prelast = int(input()), 0, 0
# while num != 0:
#     prelast = last
#     last = num % 10
#     num //= 10
# print(prelast)

#  -------------------------------------------------------------------------------------------------
#  TASK 129 (Одинаковые цифры)
#  -------------------------------------------------------------------------------------------------
#  Дано натуральное число. Напишите программу, которая определяет, состоит ли указанное число из одинаковых цифр.
#  -------------------------------------------------------------------------------------------------

# num, flag = int(input()), True
# char = num % 10
# while num != 0:
#     temp = num % 10
#     if temp != char:
#         flag = False
#     num //= 10
# if flag == True:
#     print("YES")
# else:
#     print("NO")

#  -------------------------------------------------------------------------------------------------
#  TASK 130 (Упорядоченные цифры)
#  -------------------------------------------------------------------------------------------------
#  Дано натуральное число. Напишите программу, которая определяет,
#  является ли последовательность его цифр при просмотре справа налево упорядоченной по неубыванию.
#  -------------------------------------------------------------------------------------------------

# num, flag, last, prelast  = int(input()), True, 0, 0
# while num != 0:
#     prelast = last
#     last = num % 10
#     if prelast > last:
#         flag = False
#     num //= 10
# if flag:
#     print("YES")
# else:
#     print("NO")
