#  -------------------------------------------------------------------------------------------------
#  TASK 131 (Наименьший делитель)
#  -------------------------------------------------------------------------------------------------
#  На вход программе подается число n>1. Напишите программу, которая выводит его наименьший отличный от 1 делитель.
#  -------------------------------------------------------------------------------------------------

# num = int(input())
# for i in range(2, num + 1):
#     if num % i == 0:
#         print(i)
#         break

#  -------------------------------------------------------------------------------------------------
#  TASK 132 (Следуй правилам)
#  -------------------------------------------------------------------------------------------------
#  На вход программе подается натуральное число nn. Напишите программу, которая выводит числа
#  от 1 до n включительно за исключением:
#  чисел от 5 до 9 включительно;
#  чисел от 17 до 37 включительно;
#  чисел от 78 до 87 включительно.
#  -------------------------------------------------------------------------------------------------

# num = int(input())
# for i in range(1, num + 1):
#     if 5 <= i <= 9 or 17 <= i <= 37 or 78 <= i <= 87:
#         continue
#     print(i)
