#  -------------------------------------------------------------------------------------------------
#  TASK 133 (Таблица-1)
#  -------------------------------------------------------------------------------------------------
#  Дано натуральное число (n≤ 9). Напишите программу, которая печатает таблицу размером n×3
#  состоящую из данного числа (числа отделены одним пробелом).
#  -------------------------------------------------------------------------------------------------

num = int(input())
for i in range(num):
    for j in range(1, 4):
        print(num, end=" ")
    print()

#  -------------------------------------------------------------------------------------------------
#  TASK 134 (Таблица-2)
#  -------------------------------------------------------------------------------------------------
#  Дано натуральное число (n≤ 9). Напишите программу, которая печатает таблицу размером n×5,
#  где в i-ой строке указано число i (числа отделены одним пробелом).
#  -------------------------------------------------------------------------------------------------

# size = int(input())
# for i in range(1, size + 1):
#     for j in range(1, 6):
#         print(i, end = " ")
#     print()

#  -------------------------------------------------------------------------------------------------
#  TASK 135 (Таблица-3)
#  -------------------------------------------------------------------------------------------------
#  Дано натуральное число (n≤ 9). Напишите программу,
#  которая печатает таблицу сложения для всех чисел от 1 до n в соответствии с примером.
#  -------------------------------------------------------------------------------------------------

# num = int(input())
# for i in range(1, num +1):
#     for j in range(1, 10):
#         print(i, "+", j, "=", i + j)
#     print()

#  -------------------------------------------------------------------------------------------------
#  TASK 136 (Звездный треугольник)
#  -------------------------------------------------------------------------------------------------
#  Дано нечетное натуральное число n.
#  Напишите программу, которая печатает равнобедренный звездный треугольник с основанием, равным n
#  -------------------------------------------------------------------------------------------------

# import math
# num, star = int(input()), ""
# middle = math.ceil(num / 2)
# for i in range(num):
#     if i < middle:
#         star += "*"
#         print(star)
#     else:
#         star = star[:-1]
#         print(star)

#  -------------------------------------------------------------------------------------------------
#  TASK 137 (Численный треугольник 1)
#  -------------------------------------------------------------------------------------------------
#  Дано натуральное число n. Напишите программу, которая печатает численный треугольник
#  -------------------------------------------------------------------------------------------------

# num = int(input())
# for i in range(1, num + 1):
#     for _ in range(1, i + 1):
#         print(i, end="")
#     print()

#  -------------------------------------------------------------------------------------------------
#  TASK 138 (Численный треугольник 3)
#  -------------------------------------------------------------------------------------------------
#  Дано натуральное число n. Напишите программу, которая печатает численный треугольник с высотой равной n
#  -------------------------------------------------------------------------------------------------

# row, num = int(input()), 1
# for i in range(1, row + 1):
#     for j in range(i):
#         print(num, "", end="")
#         num += 1
#     print()

#  -------------------------------------------------------------------------------------------------
#  TASK 139 (Численный треугольник 4)
#  -------------------------------------------------------------------------------------------------
#  Дано натуральное число n. Напишите программу, которая печатает численный треугольник с высотой равной n
#  -------------------------------------------------------------------------------------------------

# n = int(input())
# for i in range(1, n + 1):
#     for j in range(1, i + 1):
#         print(j, end="")
#     for k in range(i, 1, -1):
#         print(k-1, end="")
#     print()

#  -------------------------------------------------------------------------------------------------
#  TASK 140 (Делители-1)
#  -------------------------------------------------------------------------------------------------
#  На вход программе подается два натуральных числа a и b (a< b).
#  Напишите программу, которая находит натуральное число из отрезка [a;b] с максимальной суммой делителей.
#  -------------------------------------------------------------------------------------------------

# a, b, total, max_ = int(input()), int(input()), 0, 0
# for i in range(a, b + 1):
#     tempt = 0
#     for j in range(1, i + 1):
#         if i % j == 0:
#             tempt += j
#     if tempt >= total:
#         total = tempt
#         max_ = i
# print(max_, total)

#  -------------------------------------------------------------------------------------------------
#  TASK 141 (Делители-2)
#  -------------------------------------------------------------------------------------------------
#  На вход программе подается натуральное число n. Напишите программу,
#  выводящую графическое изображение делимости чисел от 1 до n включительно.
#  В каждой строке надо напечатать очередное число и столько символов «+», сколько делителей у этого числа.
#  -------------------------------------------------------------------------------------------------

# n = int(input())
# for i in range(1, n + 1):
#     temp = str(i)
#     for j in range(1, i + 1):
#         if i % j == 0:
#             temp += "+"
#     print(temp)

#  -------------------------------------------------------------------------------------------------
#  TASK 142 (Цифровой корень)
#  -------------------------------------------------------------------------------------------------
#  На вход программе подается натуральное число n. Напишите программу, которая находит цифровой корень данного числа.
#  Цифровой корень числа n получается следующим образом: если сложить все цифры этого числа,
#  затем все цифры найденной суммы и повторить этот процесс, то в результате будет получено однозначное число (цифра),
#  которое и называется цифровым корнем данного числа.
#  -------------------------------------------------------------------------------------------------

# num, total = int(input()), 0
# while len(str(num)) >= 2:
#     temp = num
#     while temp > 0:
#         total += temp % 10
#         temp //= 10
#     num = total
#     total = 0
# print(num)

#  -------------------------------------------------------------------------------------------------
#  TASK 143 (Сумма факториалов)
#  -------------------------------------------------------------------------------------------------
#  Дано натуральное число n. Напишите программу, которая выводит значение суммы 1! + 2! + .... + n!
#  -------------------------------------------------------------------------------------------------

# import math
# num, total = int(input()), 0
# for i in range(1, num + 1):
#     total += math.factorial(i)
# print(total)

#  -------------------------------------------------------------------------------------------------
#  TASK 144 (Простые числа)
#  -------------------------------------------------------------------------------------------------
#  На вход программе подается два натуральных числа a и b (a< b). Напишите программу,
#  которая находит все простые числа от a до b включительно.
#  -------------------------------------------------------------------------------------------------

# a, b, counter = int(input()), int(input()), 0
# for i in range(a, b + 1):
#     for j in range(1, i + 1):
#         if i % j == 0:
#             counter += 1
#     if counter == 2:
#         print(i)
#     counter = 0

