#  -------------------------------------------------------------------------------------------------
#  TASK 66 (Ход ферзя)
#  -------------------------------------------------------------------------------------------------
#  Напишите программу, которая считывает длины двух катетов в прямоугольном треугольнике и выводит его площадь.
#  -------------------------------------------------------------------------------------------------

# a, b = float(input()), float(input())
# print(0.5 * a * b)

#  -------------------------------------------------------------------------------------------------
#  TASK 67 (Две старушки)
#  -------------------------------------------------------------------------------------------------
#  Две старушки идут навстречу друг другу с постоянными скоростями
#  Определите, через какое время старушки встретятся, если расстояние между ними равно
#  -------------------------------------------------------------------------------------------------

# s, v1, v2 = float(input()), float(input()), float(input())
# print(s / (v1 + v2))

#  -------------------------------------------------------------------------------------------------
#  TASK 68 (Обратное число)
#  -------------------------------------------------------------------------------------------------
#  Напишите программу, которая считывает с клавиатуры одно число и выводит обратное ему.
#  Если при этом введённое с клавиатуры число – ноль, то вывести «Обратного числа не существует» (без кавычек).
#  -------------------------------------------------------------------------------------------------

# num = float(input())
# if num == 0:
#     print("Обратного числа не существует")
# else:
#     print(1 / num)

#  -------------------------------------------------------------------------------------------------
#  TASK 69 (451 градус по Фаренгейту )
#  -------------------------------------------------------------------------------------------------
#  Напишите программу, которая определяет, какой температуре по шкале Цельсия соответствует
#  указанное значение по шкале Фаренгейта.
#  -------------------------------------------------------------------------------------------------

# F = float(input())
# print((5 / 9) * (F - 32))

#  -------------------------------------------------------------------------------------------------
#  TASK 70 (Dog age)
#  -------------------------------------------------------------------------------------------------
#  На вход программе подается число n – количество собачьих лет. Напишите программу,
#  которая вычисляет возраст собаки в человеческих годах.
#  -------------------------------------------------------------------------------------------------

# age = float(input())
# if age <= 2:
#     print(age * 10.5)
# else:
#     print(21 + (age - 2) * 4)

#  -------------------------------------------------------------------------------------------------
#  TASK 71 (Первая цифра после точки)
#  -------------------------------------------------------------------------------------------------
#  Дано положительное действительное число. Выведите его первую цифру после десятичной точки.
#  -------------------------------------------------------------------------------------------------

# num = float(input())
# print(int((num - int(num)) * 100) // 10)

#  -------------------------------------------------------------------------------------------------
#  TASK 72 (Дробная часть)
#  -------------------------------------------------------------------------------------------------
#  Дано положительное действительное число. Выведите его дробную часть.
#  -------------------------------------------------------------------------------------------------

# num = float(input())
# print(num - int(num))

#  -------------------------------------------------------------------------------------------------
#  TASK 73 (Наибольшее и наименьшее)
#  -------------------------------------------------------------------------------------------------
#  Напишите программу, которая находит наименьшее и наибольшее из пяти чисел.
#  -------------------------------------------------------------------------------------------------

# a, b, c, d, e = int(input()), int(input()), int(input()), int(input()), int(input())
# print("Наименьшее число =", min(a, b, c, d, e))
# print("Наибольшее число =", max(a, b, c, d, e))

#  -------------------------------------------------------------------------------------------------
#  TASK 74 (Сортировка трёх)
#  -------------------------------------------------------------------------------------------------
#  Напишите программу, которая упорядочивает три числа от большего к меньшему.
#  -------------------------------------------------------------------------------------------------

# a, b, c = int(input()), int(input()), int(input())
# print(max(a, b, c))
# print(a + b + c - max(a, b, c) - min(a, b, c))
# print(min(a, b, c))

#  -------------------------------------------------------------------------------------------------
#  TASK 75 (Интересное число)
#  -------------------------------------------------------------------------------------------------
#  Назовем число интересным, если в нем разность максимальной и минимальной цифры равняется средней по величине цифре.
#  Напишите программу, которая определяет интересное число или нет. Если число интересное,
#  следует вывести – «Число интересное» иначе «Число неинтересное».
#  -------------------------------------------------------------------------------------------------

# num = int(input())
# a, b, c = num // 100, num % 100 // 10, num % 10
# if max(a, b, c) - min(a, b, c) == a + b + c - max(a, b, c) - min(a, b, c):
#     print("Число интересное")
# else:
#     print("Число неинтересное")

#  -------------------------------------------------------------------------------------------------
#  TASK 76 (Абсолютная сумма)
#  -------------------------------------------------------------------------------------------------
#  Даны пять чисел. Напишите программу, которая вычисляет сумму их модулей
#  -------------------------------------------------------------------------------------------------

# a1, a2, a3, a4, a5 = abs(float(input())), abs(float(input())), abs(float(input())), abs(float(input())), abs(float(input()))
# print(a1 + a2 + a3 + a4 + a5)

#  -------------------------------------------------------------------------------------------------
#  TASK 77 (Манхэттенское расстояние)
#  -------------------------------------------------------------------------------------------------
#  Прогуливаясь по Манхэттену, вы не можете попасть из точки А в точку Б по кратчайшему пути.
#  Если только вы не умеете проходить сквозь стены, вам обязательно придется идти вдоль его
#  параллельно-перпендикулярных улиц. На плоскости манхэттенское расстояние между двумя точками  определяется так
#  |p1-q1|+|p2-q2| Напишите программу определяющую манхэттенское расстояние между двумя точками,
#  координаты которых заданы.
#  -------------------------------------------------------------------------------------------------

# p1, p2, q1, q2 = int(input()), int(input()), int(input()), int(input())
# print(abs(p1 - q1) + abs(p2 - q2))
