#  -------------------------------------------------------------------------------------------------
#  TASK 148 (В столбик 1)
#  -------------------------------------------------------------------------------------------------
#  На вход программе подается одна строка.
#  Напишите программу, которая выводит элементы строки с индексами 0, 2, 4... в столбик
#  -------------------------------------------------------------------------------------------------

# text = input()
# for c in range(0, len(text), 2):
#     print(text[c])

#  -------------------------------------------------------------------------------------------------
#  TASK 149 (В столбик 2)
#  -------------------------------------------------------------------------------------------------
#  На вход программе подается одна строка. Напишите программу,
#  которая выводит в столбик элементы строки в обратном порядке.
#  -------------------------------------------------------------------------------------------------

# text = input()
# for c in range(-1, -len(text)-1, -1):
#     print(text[c])

#  -------------------------------------------------------------------------------------------------
#  TASK 150 (ФИО)
#  -------------------------------------------------------------------------------------------------
#  На вход программе подаются три строки: имя, фамилия и отчество.
#  Напишите программу, которая выводит инициалы человека.
#  -------------------------------------------------------------------------------------------------

# name1, name2, name3 = input(), input(), input()
# print(name2[0] + name1[0] + name3[0])

#  -------------------------------------------------------------------------------------------------
#  TASK 151 (Цифра 1)
#  -------------------------------------------------------------------------------------------------
#  На вход программе подается одна строка состоящая из цифр.
#  Напишите программу, которая считает сумму цифр данной строки.
#  -------------------------------------------------------------------------------------------------

# text, total = input(), 0
# for c in range(0, len(text)):
#     total += int(text[c])
# print(total)

#  -------------------------------------------------------------------------------------------------
#  TASK 152 (Цифра 2)
#  -------------------------------------------------------------------------------------------------
#  На вход программе подается одна строка. Напишите программу, которая выводит сообщение «Цифра» (без кавычек),
#  если строка содержит цифру. В противном случае вывести сообщение «Цифр нет» (без кавычек).
#  -------------------------------------------------------------------------------------------------

# text, flag = input(), False
# for c in text:
#     if c in "0123456789":
#         flag = True
# if flag:
#     print('Цифра')
# else:
#     print('Цифр нет')

#  -------------------------------------------------------------------------------------------------
#  TASK 153 (Сколько раз?)
#  -------------------------------------------------------------------------------------------------
#  На вход программе подается одна строка. Напишите программу,
#  которая определяет сколько раз в строке встречаются символы + и *
#  -------------------------------------------------------------------------------------------------

# text, counter1, counter2 = input(), 0, 0
# for c in text:
#     if c == '+':
#         counter1 += 1
#     elif c == '*':
#         counter2 += 1
# print('Символ + встречается', counter1, 'раз')
# print('Символ * встречается', counter2, 'раз')

#  -------------------------------------------------------------------------------------------------
#  TASK 154 (Одинаковые соседи)
#  -------------------------------------------------------------------------------------------------
#  На вход программе подается одна строка.
#  Напишите программу, которая определяет сколько в ней одинаковых соседних символов.
#  -------------------------------------------------------------------------------------------------

# text, counter, a, b = input(), 0, "", ""
# for i in range(1, len(text)):
#     a = text[i-1]
#     b = text[i]
#     if a == b:
#         counter += 1
# print(counter)

#  -------------------------------------------------------------------------------------------------
#  TASK 155 (Гласные и согласные)
#  -------------------------------------------------------------------------------------------------
#  На вход программе подается одна строка с буквами русского языка.
#  Напишите программу, которая определяет количество гласных и согласных букв.
#  -------------------------------------------------------------------------------------------------

# text, counter1, counter2 = input(), 0, 0
# for c in text:
#     if c in "ауоыиэяюёеАУОЫИЭЯЮЁЕ":
#         counter1 += 1
#     elif c in "бвгджзйклмнпрстфхцчшщБВГДЖЗЙКЛМНПРСТФХЦЧШЩ":
#         counter2 += 1
# print("Количество гласных букв равно", counter1)
# print("Количество согласных букв равно", counter2)

#  -------------------------------------------------------------------------------------------------
#  TASK 156 (Decimal to Binary)
#  -------------------------------------------------------------------------------------------------
#  На вход программе подается натуральное число, записанное в десятичной системе счисления.
#  Напишите программу, которая переводит данное число в двоичную систему счисления.
#  -------------------------------------------------------------------------------------------------

# num, binary = int(input()), ''
# while num > 0:
#     binary = str(num % 2) + binary
#     num = int(num / 2)
# print(binary)

#  -------------------------------------------------------------------------------------------------
#  TASK 157 (Палиндром)
#  -------------------------------------------------------------------------------------------------
#  На вход программе подается одно слово, записанное в нижнем регистре.
#  Напишите программу, которая определяет является ли оно палиндромом.
#  -------------------------------------------------------------------------------------------------

# text = input()
# if text == text[::-1]:
#     print("YES")
# else:
#     print("NO")

#  -------------------------------------------------------------------------------------------------
#  TASK 158 (Делаем срезы 1)
#  -------------------------------------------------------------------------------------------------
#  На вход программе подается одна строка. Напишите программу, которая выводит:
#  общее количество символов в строке; исходную строку повторенную 3 раза; первый символ строки;
#  первые три символа строки; последние три символа строки; строку в обратном порядке;
#  строку с удаленным первым и последним символом.
#  -------------------------------------------------------------------------------------------------

# text = input()
# print(len(text))
# print(text * 3)
# print(text[0])
# print(text[:3])
# print(text[-3:])
# print(text[::-1])
# print(text[1:][:-1])

#  -------------------------------------------------------------------------------------------------
#  TASK 159 (Делаем срезы 2)
#  -------------------------------------------------------------------------------------------------
#  На вход программе подается одна строка. Напишите программу, которая выводит:
#  третий символ этой строки; предпоследний символ этой строки; первые пять символов этой строки;
#  всю строку, кроме последних двух символов; все символы с четными индексами; все символы с нечетными индексами;
#  все символы в обратном порядке; все символы строки через один в обратном порядке, начиная с последнего.
#  -------------------------------------------------------------------------------------------------

# text = input()
# print(text[2])
# print(text[-2])
# print(text[:5])
# print(text[:-2])
# print(text[::2])
# print(text[1::2])
# print(text[::-1])
# print(text[::-2])

#  -------------------------------------------------------------------------------------------------
#  TASK 160 (Две половинки)
#  -------------------------------------------------------------------------------------------------
#  На вход программе подается одна строка. Напишите программу, которая выводит:
#  третий символ этой строки; предпоследний символ этой строки; первые пять символов этой строки;
#  всю строку, кроме последних двух символов; все символы с четными индексами; все символы с нечетными индексами;
#  все символы в обратном порядке; все символы строки через один в обратном порядке, начиная с последнего.
#  -------------------------------------------------------------------------------------------------

# import math
# text = input()
# print(text[math.ceil(len(text)/2):] + text[:math.ceil(len(text)/2)])
