#  -------------------------------------------------------------------------------------------------
#  TASK 173 (Символы в диапазоне)
#  -------------------------------------------------------------------------------------------------
#  На вход программе подаются два числа aa и bb. Напишите программу,
#  которая для каждого кодового значения в диапазоне от a до b (включительно),
#  выводит соответствующий ему символ из таблицы символов Unicode.
#  -------------------------------------------------------------------------------------------------

# a, b = int(input()), int(input())
# for i in range(a, b +1):
#     print(chr(i), end=" ")

#  -------------------------------------------------------------------------------------------------
#  TASK 174 (Простой шифр)
#  -------------------------------------------------------------------------------------------------
#  На вход программе подается строка текста. Напишите программу,
#  которая переводит каждый ее символ в соответствующий ему код из таблицы символов Unicode.
#  -------------------------------------------------------------------------------------------------

# text = input()
# for c in text:
#     print(ord(c), end=" ")

#  -------------------------------------------------------------------------------------------------
#  TASK 175 (Шифр Цезаря)
#  -------------------------------------------------------------------------------------------------
#   Напишите программу для декодирования этого шифра.
#  -------------------------------------------------------------------------------------------------

# num, text = int(input()), input()
# for c in text:
#     n = ord(c) - num
#     if n < 97:
#         n = 122 - (96 - n)
#     print(chr(n), end='')

