#  -------------------------------------------------------------------------------------------------
#  TASK 31 (Пароль)
#  -------------------------------------------------------------------------------------------------
#  При регистрации на сайтах требуется вводить пароль дважды. Это сделано для безопасности,
#  поскольку такой подход уменьшает возможность неверного ввода пароля. Напишите программу,
#  которая сравнивает пароль и его подтверждение. Если они совпадают,
#  то программа выводит: «Пароль принят», иначе: «Пароль не принят».
#  -------------------------------------------------------------------------------------------------

# str1, str2 = input(), input()
# if str1 == str2:
#     print("Пароль принят")
# else:
#     print("Пароль не принят")

#  -------------------------------------------------------------------------------------------------
#  TASK 32 (Четное или нечетное?)
#  -------------------------------------------------------------------------------------------------
#  Напишите программу, которая определяет, является число четным или нечетным.
#  -------------------------------------------------------------------------------------------------

# num = int(input())
# if num % 2 == 0:
#     print("Четное")
# else:
#     print("Нечетное")

#  -------------------------------------------------------------------------------------------------
#  TASK 33 (Соотношение)
#  -------------------------------------------------------------------------------------------------
#  Напишите программу, которая проверяет, что для заданного четырехзначного числа выполняется следующее соотношение:
#  сумма первой и последней цифр равна разности второй и третьей цифр.
#  -------------------------------------------------------------------------------------------------

# num = int(input())
# if num // 1000 + num % 10 == num % 1000 // 100 - num % 100 // 10:
#     print("ДА")
# else:
#     print("НЕТ")

#  -------------------------------------------------------------------------------------------------
#  TASK 34 (Роскомнадзор)
#  -------------------------------------------------------------------------------------------------
#  Напишите программу, которая определяет, разрешен пользователю доступ к интернет-ресурсу или нет.
#  -------------------------------------------------------------------------------------------------

# age = int(input())
# if age >= 18:
#     print("Доступ разрешен")
# else:
#     print("Доступ запрещен")

#  -------------------------------------------------------------------------------------------------
#  TASK 36 (Арифметическая прогрессия)
#  -------------------------------------------------------------------------------------------------
#  Напишите программу, которая определяет, являются ли три заданных числа (в указанном порядке)
#  последовательными членами арифметической прогрессии.
#  -------------------------------------------------------------------------------------------------

# num1, num2, num3 = int(input()), int(input()), int(input())
# if num3 - num2 == num2 - num1:
#     print("YES")
# else:
#     print("NO")

#  -------------------------------------------------------------------------------------------------
#  TASK 37 (Наименьшее из двух чисел)
#  -------------------------------------------------------------------------------------------------
#  Напишите программу, которая определяет наименьшее из двух чисел.
#  -------------------------------------------------------------------------------------------------

# num1, num2 = int(input()), int(input())
# if num1 <= num2:
#     print(num1)
# else:
#     print(num2)

#  -------------------------------------------------------------------------------------------------
#  TASK 38 (Наименьшее из четырёх чисел)
#  -------------------------------------------------------------------------------------------------
#  Напишите программу, которая определяет наименьшее из четырёх чисел.
#  -------------------------------------------------------------------------------------------------

# a, b, c, d = int(input()), int(input()), int(input()), int(input())
# res = 0
# if a < b:
#     res = a
# else:
#     res = b
# if res > c:
#     res = c
# if res > d:
#     res = d
# print(res)

#  -------------------------------------------------------------------------------------------------
#  TASK 39 (Возрастная группа)
#  -------------------------------------------------------------------------------------------------
#  Напишите программу, которая по введённому возрасту пользователя сообщает, к какой возрастной группе он относится:
#  до 13 включительно – детство;
#  от 14 до 24 – молодость;
#  от 25 до 59 – зрелость;
#  от 60 – старость.
#  -------------------------------------------------------------------------------------------------

# age = int(input())
# if age <= 13:
#     print("детство")
# if 14 <= age <= 24:
#     print("молодость")
# if 25 <= age <= 59:
#     print("зрелость")
# if age >= 60:
#     print("старость")

#  -------------------------------------------------------------------------------------------------
#  TASK 40 (Только +)
#  -------------------------------------------------------------------------------------------------
#  Напишите программу, которая считывает три числа и подсчитывает сумму только положительных чисел.
#  -------------------------------------------------------------------------------------------------

# a, b, c = int(input()), int(input()), int(input())
# res = 0
# if a > 0:
#     res = res + a
# if b > 0:
#     res = res + b
# if c > 0:
#     res = res + c
# print (res)
