#  -------------------------------------------------------------------------------------------------
#  TASK 064 (Вершина параболы)
#  -------------------------------------------------------------------------------------------------
#  Уравнение параболы имеет вид y =ax^2 + bx + cy.(a != 0) Напишите программу, которая по введенным значениям
#  a,b,c определяет и выводит вершину параболы.
#  -------------------------------------------------------------------------------------------------

# a, b, c = int(input()), int(input()), int(input())
# print(((-b / (2 * a)), (4 * a * c - b ** 2) / (4 * a)))

#  -------------------------------------------------------------------------------------------------
#  TASK 065 (Конкурсный отбор)
#  -------------------------------------------------------------------------------------------------
#  Напишите программу, которая выводит список хорошистов и отличников в классе.
#  На вход программе подается натуральное число n, далее следует n строк с фамилией школьника и
#  его оценкой на каждой из них.
#  -------------------------------------------------------------------------------------------------

# n, res = int(input()), []
# for i in range(n):
#     res.append(input().split())
#     print(res[i][0], res[i][1])
# print()
# for i in range(len(res)):
#     if int(res[i][1]) >= 4:
#         print(res[i][0], res[i][1])

#  -------------------------------------------------------------------------------------------------
#  TASK 066 (Последовательность Трибоначчи)
#  -------------------------------------------------------------------------------------------------
#  Напишите программу, которая считывает натуральное число n и выводит первые n чисел последовательности Трибоначчи.
#  На вход программе подается одно число (n≤100) – количество членов последовательности.
#  -------------------------------------------------------------------------------------------------

# n, tup = int(input()), (1, 1, 1)
# if n == 1:
#     print(tup[0])
# elif n == 2:
#     print(tup[0], tup[1])
# elif n == 3:
#     print(*tup)
# else:
#     for _ in range(n - 3):
#         n = tup[-1] + tup[-2] + tup[-3]
#         tup += (n,)
#     print(*tup)
