#  -------------------------------------------------------------------------------------------------
#  TASK 119 (Генератор паролей 2)
#  -------------------------------------------------------------------------------------------------
#  На вход программе подается Decimal число dd. Напишите программу, которая вычисляет значение выражения:
#  -------------------------------------------------------------------------------------------------

# from decimal import *
# num = Decimal(input())
# print(num.exp() + num.ln() + num.log10() + num.sqrt())
