#  -------------------------------------------------------------------------------------------------
#  TASK 120 (Генератор паролей 2)
#  -------------------------------------------------------------------------------------------------
#  Даны два натуральных числа m и n. Напишите программу, которая сокращает дробь и выводит ее.
#  -------------------------------------------------------------------------------------------------

# from fractions import Fraction
#
# m, n = int(input()), int(input())
# print(Fraction(m, n))

#  -------------------------------------------------------------------------------------------------
#  TASK 121 (Операции над дробями)
#  -------------------------------------------------------------------------------------------------
#  Даны две дроби в формате a/b. Напишите программу, которая вычисляет и выводит их сумму, разность,
#  произведение и частное.
#  -------------------------------------------------------------------------------------------------

# from fractions import Fraction
#
# num1, num2 = input(), input()
# print(f'{num1} + {num2} = {Fraction(num1) + Fraction(num2)}')
# print(f'{num1} - {num2} = {Fraction(num1) - Fraction(num2)}')
# print(f'{num1} * {num2} = {Fraction(num1) * Fraction(num2)}')
# print(f'{num1} / {num2} = {Fraction(num1) / Fraction(num2)}')

#  -------------------------------------------------------------------------------------------------
#  TASK 122 (Сумма дробей 1)
#  -------------------------------------------------------------------------------------------------
#  На вход программе подается натуральное число nn. Напишите программу, которая вычисляет и выводит рациональное число,
#  равное значению выражения
#  -------------------------------------------------------------------------------------------------

# from fractions import Fraction
#
# n = int(input())
# total = Fraction(0)
# if n == 1:
#     print(n)
# else:
#     for i in range(1, n + 1):
#         total += Fraction(1, i ** 2)
#     print(total)

#  -------------------------------------------------------------------------------------------------
#  TASK 123 (Сумма дробей 2)
#  -------------------------------------------------------------------------------------------------
#  На вход программе подается натуральное число nn. Напишите программу, которая вычисляет и выводит рациональное число,
#  равное значению выражения
#  -------------------------------------------------------------------------------------------------

# from fractions import Fraction
# from math import factorial
#
# n = int(input())
# total = Fraction(0)
# if n == 1:
#     print(n)
# else:
#     for i in range(1, n + 1):
#         total += Fraction(1, factorial(i))
#     print(total)

#  -------------------------------------------------------------------------------------------------
#  TASK 124 (Юный математик)
#  -------------------------------------------------------------------------------------------------
#  Дима учится в седьмом классе и сейчас они проходят обыкновенные дроби с натуральными числителем и знаменателем.
#  Вчера на уроке математики Дима узнал, что дробь называется правильной, если ее числитель меньше знаменателя,
#  и несократимой, если нет равной ей дроби с меньшими натуральными числителем и знаменателем.
#  Дима очень любит математику, поэтому дома он долго экспериментировал, придумывая и решая разные задачки с
#  правильными несократимыми дробями. Одну из этих задач Дима предлагает решить вам с помощью компьютера.
#  На вход программе подается натуральное число nn. Напишите программу, которая находит
#  наибольшую правильную несократимую дробь с суммой числителя и знаменателя равной n.
#  -------------------------------------------------------------------------------------------------

# from fractions import Fraction
#
# n = int(input())
# nums = [i for i in range(1, n+1)]
# fracts = []
# for i in nums:
#     for j in nums:
#         temp = Fraction(i, j)
#         if temp.numerator + temp.denominator == n and i < j:
#             fracts.append(temp)
# print(max(fracts))

#  -------------------------------------------------------------------------------------------------
#  TASK 125 (Упорядоченные дроби)
#  -------------------------------------------------------------------------------------------------
#  На вход программе подается натуральное число nn. Напишите программу, которая выводит
#  в порядке возрастания все несократимые дроби, заключённые между 0 и 1, знаменатель которых не превосходит n.
#  -------------------------------------------------------------------------------------------------

# from fractions import Fraction
#
# n = int(input())
# nums = [i for i in range(1, n+1)]
# fracts = set()
# for i in nums:
#     for j in nums:
#         temp = Fraction(i, j)
#         if i < j:
#             fracts.add(temp)
# print(*sorted(fracts), sep='\n')
