#  -------------------------------------------------------------------------------------------------
#  TASK 126 (Операции над комплексными числами)
#  -------------------------------------------------------------------------------------------------
#  Даны два комплексных числа. Напишите программу, которая вычисляет и выводит их сумму, разность и произведение.
#  -------------------------------------------------------------------------------------------------

# cmplx1 = complex(input())
# cmplx2 = complex(input())
# print(f'{cmplx1} + {cmplx2} = {cmplx1 + cmplx2}')
# print(f'{cmplx1} - {cmplx2} = {cmplx1 - cmplx2}')
# print(f'{cmplx1} * {cmplx2} = {cmplx1 * cmplx2}')

#  -------------------------------------------------------------------------------------------------
#  TASK 127 (Сопряженные числа)
#  -------------------------------------------------------------------------------------------------
#  Дано натуральное число nn и два комплексных числа z_1, , z_2.
#  Напишите программу, которая вычисляет и выводит значение выражения
#  -------------------------------------------------------------------------------------------------

# n = int(input())
# cmplx1 = complex(input())
# cmplx2 = complex(input())
# print(cmplx1 ** n + cmplx2 ** n + cmplx1.conjugate() ** n + cmplx2.conjugate() ** (n+1))
